/***************************************************************************//**
  @file     App.c
  @brief    Application functions
  @author   Nicolás Magliola
 ******************************************************************************/

/*******************************************************************************
 * INCLUDE HEADER FILES
 ******************************************************************************/

#include "board.h"
#include "gpio.h"


/*******************************************************************************
 * CONSTANT AND MACRO DEFINITIONS USING #DEFINE
 ******************************************************************************/

/*******************************************************************************
 * FUNCTION PROTOTYPES FOR PRIVATE FUNCTIONS WITH FILE LEVEL SCOPE
 ******************************************************************************/

static void delayLoop(uint32_t veces);


/*******************************************************************************
 *******************************************************************************
                        GLOBAL FUNCTION DEFINITIONS
 *******************************************************************************
 ******************************************************************************/
__ISR__ PORTA_IRQHandler (void){
	PORT_ClearInterruptFlag(PIN_SW3);
	gpioToggle(PIN_LED_BLUE);
}


/* Función que se llama 1 vez, al comienzo del programa */
void App_Init (void)
{
    gpioMode(PIN_LED_BLUE, OUTPUT);
    gpioMode(PIN_SW3, INPUT);
    gpioIRQC(PIN_SW3, INTERRUPT_RISING_EDGE);

    uint32_t ans = PORT_PCR_IRQC(INTERRUPT_RISING_EDGE);
    //PORT_Type *port = portPtrs[0];
	//bool aux = (port->PCR[4] & (1<<24)) == (1<<24);
	//PORTA_IRQHandler()
    NVIC_EnableIRQ(PORTA_IRQn);

}

/* Función que se llama constantemente en un ciclo infinito */
void App_Run (void)
{

	// Loop
}


/*******************************************************************************
 *******************************************************************************
                        LOCAL FUNCTION DEFINITIONS
 *******************************************************************************
 ******************************************************************************/

static void delayLoop(uint32_t veces)
{
    while (veces--);
}


/*******************************************************************************
 ******************************************************************************/
